In [1]:
import pandas as pd
from sqlalchemy import create_engine
import os
import numpy as np

In [2]:
csv_file = os.path.join("Resources", "state_pop.csv")

state_df = pd.read_csv(csv_file)

In [3]:
state_df.head()

        State Abbreviation  Population
0     Alabama           AL   328239523
1      Alaska           AK     4903185
2     Arizona           AZ      731545
3    Arkansas           AR     7278717
4  California           CA     3017804

In [4]:
pg_user = 'postgres'
pg_password = 'Rouzbeh237*tx'
db_name = 'POTUS_db'

connection_string = f"{pg_user}:{pg_password}@localhost:5432/{db_name}"
engine = create_engine(f'postgresql://{connection_string}')

In [5]:
engine.table_names()

['States', 'Polls', 'Candidates', 'Candidate_Spending']

In [6]:
state_df.to_sql(name="States", con=engine, if_exists='append', index=False)

In [7]:
pd.read_sql_query('select * from "States"', con=engine).head()

        State Abbreviation  Population
0     Alabama           AL   328239523
1      Alaska           AK     4903185
2     Arizona           AZ      731545
3    Arkansas           AR     7278717
4  California           CA     3017804